IDENTIFICATION DIVISION.
PROGRAM-ID. ARITH.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 WS-A PIC 9(2) VALUE 0.
PROCEDURE DIVISION.
MAIN-PARA.
    COMPUTE WS-A = 2 + 3 * 4.
    STOP RUN.

