01 IDENTIFICATION DIVISION.
02 PROGRAM-ID. ARITH.
03 DATA DIVISION.
04 WORKING-STORAGE SECTION.
05     01 WS-A PIC 9(2) VALUE 0.
06 PROCEDURE DIVISION.
07 MAIN-PARA.
08     COMPUTE WS-A = 2 + 3 * 4.
09     STOP RUN.
10 
