01 IDENTIFICATION DIVISION.
02 PROGRAM-ID. HELLO.
03 * This is a comment
04 DATA DIVISION.
05 WORKING-STORAGE SECTION.
06 01 WS-A PIC 9(2) VALUE 0.
07 01 WS-NAME PIC X(20) VALUE 'TEST'.
08 PROCEDURE DIVISION.
09 A-PARA.
10     PERFORM B-PARA VARYING WS-A FROM 2 BY 2 UNTIL WS-A=12
11     STOP RUN.
12 B-PARA.
13     DISPLAY 'B-PARA ' WS-A.
14     DISPLAY 'B-PARA'.
