01 IDENTIFICATION DIVISION.
02 PROGRAM-ID. IFTEST.
03 DATA DIVISION.
04 WORKING-STORAGE SECTION.
05     01 WS-A PIC 9(2) VALUE 0.
06 PROCEDURE DIVISION.
07 MAIN-PARA.
08     IF WS-A > 10 THEN
09         DISPLAY 'GREATER'
10     ELSE
11         DISPLAY 'LESS'
12     END-IF.
13     STOP RUN.
