IDENTIFICATION DIVISION.
PROGRAM-ID. IFTEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 WS-A PIC 9(2) VALUE 0.
PROCEDURE DIVISION.
MAIN-PARA.
    IF WS-A > 10 THEN
        DISPLAY 'GREATER'
    ELSE
        DISPLAY 'LESS'
    END-IF.
    STOP RUN.
