IDENTIFICATION DIVISION.
PROGRAM-ID. PERFTEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 WS-A PIC 9(2) VALUE 0.
PROCEDURE DIVISION.
MAIN-PARA.
    PERFORM A-PARA.
    PERFORM A-PARA THRU B-PARA.
    PERFORM A-PARA UNTIL WS-A > 10.
    PERFORM VARYING WS-A FROM 1 BY 1 UNTIL WS-A > 5
        DISPLAY WS-A
    END-PERFORM.
    STOP RUN.

A-PARA.
    DISPLAY 'A'.
B-PARA.
    DISPLAY 'B'.

