01 IDENTIFICATION DIVISION.
02 PROGRAM-ID. PERFTEST.
03 DATA DIVISION.
04 WORKING-STORAGE SECTION.
05     01 WS-A PIC 9(2) VALUE 0.
06 PROCEDURE DIVISION.
07 MAIN-PARA.
08     PERFORM A-PARA.
09     PERFORM A-PARA THRU B-PARA.
10     PERFORM A-PARA UNTIL WS-A > 10.
11     PERFORM VARYING WS-A FROM 1 BY 1 UNTIL WS-A > 5
12         DISPLAY WS-A
13     END-PERFORM.
14     STOP RUN.
15 
16 A-PARA.
17     DISPLAY 'A'.
18 B-PARA.
19     DISPLAY 'B'.
20 
