IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 WS-A PIC 9(2) VALUE 0.
PROCEDURE DIVISION.
A-PARA.
    DISPLAY 'HELLO'.
    STOP RUN.

